#include <iostream>

int pA[22] = {
    0, 500, 300, 300, 200, 200, 200, // ~6등
    50, 50, 50, 50, 30, 30, 30, 30, 30, //7~15 
    10, 10, 10, 10, 10, 10 // 15 ~ 22
};
int pB[32] {
    0, 512, 256, 256, 128, 128, 128, 128,
    64, 64, 64, 64, 64, 64, 64, 64,
    32, 32, 32, 32, 32, 32, 32, 32,
    32, 32, 32, 32, 32, 32, 32, 32,
};


int main() {
    int T,A,B;
    scanf("%d", &T);
    
    while(T--) {
        int moneyA=0, moneyB=0;
        scanf("%d %d", &A, &B);
        if(A<22) {
            moneyA = pA[A] * 10000;
        }
        if(B<32) {
            moneyB = pB[B] * 10000;
        }
    
        printf("%d\n", moneyA+moneyB);
    }

    return 0;
}